/***************************************************************************

                       数字电位器(POT)标准化接口
此驱动通过Id，以及对应回调函数，支持多个POT或不同接口类型芯片
****************************************************************************/
#ifndef _POT_H
#define _POT_H

/*******************************************************************************
                               相关定义
********************************************************************************/

//支持硬件实时延时检测时，全局定义,同时定义延时检测周期 Pot_Task()调用周期为单位
#define SUPPORT_POT_DELAY_HW_CHECK      255            

//数字电位器支持最高位数(最低位数固定为0)
#ifndef POT_UP
  #define POT_UP    255
#endif

//数字电位器单位
#if POT_UP <= 255
  #define PotLen_t  unsigned char
#else
  #define PotLen_t  unsigned short
#endif

/*******************************************************************************
                             相关结构
********************************************************************************/
struct _PotInfo{
  PotLen_t Pos;   //数字电位器位置
};

struct _Pot{
  struct _PotInfo Info;
  PotLen_t CurPos;   //当前调整的位置
  unsigned char Id; //分配的ID号(支持多个POT)
  unsigned char Flag;//相关标志，见定义
  #ifdef SUPPORT_POT_DELAY_HW_CHECK   //支持硬件实时延时检测时
    unsigned short Delay;     //硬件检测延时时间
  #endif
};

//相关标志定义为:
#define POT_HW_SYNC_FINAL    0x80   //位置同步完成
#define POT_HW_COMM_WAITTING 0x40   //通讯等待中
#define POT_HW_COMM_ERR_MASK 0x0f  //硬件通讯计数,此值表示硬件未通讯上

/***************************************************************************
                          对外接口部分
***************************************************************************/

//-------------------------------初始化函数---------------------------------
void Pot_Init(signed char IsInited,
              struct _Pot *pPot, unsigned char Id);

//-----------------------------任务函数---------------------------------
//<8ms调用一次
void Pot_Task(struct _Pot *pPot);

//---------------------------得到电位器当前位置-----------------------------
#define Pot_GetPos(pot)  ((pot)->CurPos)

//------------------------更新电位器位置---------------------------------
void Pot_UpdatePos(struct _Pot *pPot, unsigned char NewPos);

//---------------------------恢复电位器位置---------------------------------
#define Pot_RestorePos(pot) do{\
  Pot_UpdatePos(pot, (pot)->Info.Pos); }while(0)

//---------------------------保存电位器当前位置-----------------------------
void Pot_SavePos(struct _Pot *pPot);

//------------------------结束电位器位置到硬件POT-----------------------------
//POT通讯完成后调用
void Pot_Pos2HwEnd(struct _Pot *pPot, 
                   signed char Resume);//负错误，否则正确

/***************************************************************************
                          回调函数
***************************************************************************/

//---------------------------得到默认POT位置-----------------------------
//未初始化时调用
PotLen_t Pot_cbGetDefaultPos(const struct _Pot *pPot);

//-------------------------硬件初始化调用-----------------------------
void Pot_cbPos2HwInit(const struct _Pot *pPot);

//-------------------------开始电位器位置到硬件POT-----------------------------
//即将当前位置打到数字电位器上，根据不同通讯由硬件实现
//返回0:正常结束，负：未通讯上结束，正：通讯过程中(通讯完成需调Pot_Pos2HwEnd()告知)
signed char Pot_cbPos2HwStart(const struct _Pot *pPot);

#endif
