/*******************************************************************************

                          内存管理单元

*******************************************************************************/

#ifndef __MEM_MNG_H
#define __MEM_MNG_H

#include <ysizet.h>//size_t

/*******************************************************************************

                          相关配置

*******************************************************************************/

//定义对齐个数
#ifndef MEMMNG_ALIGNMENT
  #define MEMMNG_ALIGNMENT 4
#endif


//定义堆大小,字节为单位
#ifndef MEM_MNG_HEAP_SIZE //由应用程序决定
  #define  MEM_MNG_HEAP_SIZE		((size_t)10240)  //默认10k
#endif 

extern size_t xNextFreeByte; //指已使用的内存CHAR个数;


//----------------------------模块初始化--------------------------------------
//开机时调用,保证堆空间数据为0
void MemMng_Init(void);

//----------------------------内存分配-----------------------------------------
void *MemMng_pvMalloc(size_t xWantedSize);

//----------------------------内存窃取函数-------------------------------------
//此函数将未使部用部空间用它作它，仅Heap_1模式，单线程调用
//注意可用空间为：MEM_MNG_HEAP_SIZE - xNextFreeByte;
void *MemMng_pvSteal(void);

//----------------------------内存释放-----------------------------------------
//注意实现是否能够支持,不支持时不能够调用
void MemMng_Free(void *pv);

//----------------------------内存溢出通报回调---------------------------------
void MemMng_cbOvNotify(void); 



#endif //#define __MEM_MNG_H