/***********************************************************************

		                    测试子模块
此模块应用无关
***********************************************************************/

#include "Test.h"
struct _Test Test;          //直接实例化

/***********************************************************************
		                      相关函数实现
***********************************************************************/

//----------------------普通任务函数-------------------------------
//放入256ms进程中扫描
void Test_Task(void)
{
  if(!Test.Index) return;
  Test.Index--;
  if(!Test.Index){
    Test_cbExitNotify();
  }
}

//-------------------------开始测试函数-------------------------------
void Test_Start(void)
{
  Test.Index = TEST_COUNT;
  Test_cbStartNotify();
}

//----------------------强制清测试状态函数---------------------------
void Test_Clr(void)
{
  Test.Index = 0;
  Test_cbExitNotify();
}
