/*********************************************************************

             延时函数标准接口-在cm0中的实现

**********************************************************************/

#include "Delay.h"

//注：SYS_MHZ为全局定义

//-----------------------微秒延时函数---------------------------------
void DelayUs(unsigned short Us)
{
  for(; Us > 0; Us--){
    for(int i = 0; i < ((SYS_MHZ + 3) / 4); i++);
  }
}

//-----------------------毫秒延时函数---------------------------------
void DelayMs(unsigned short Ms)
{
  for(; Ms > 0; Ms--) DelayUs(1000);
}
