/********************************************************************************

                         多通道电压比较器模块
多通道是指每个电压比较器的输入端有多个，并以动态切换通道方式进行识别
本模块使用扫描方式而未使用中断，适用于对实时性要求不高的场合
*******************************************************************************/
#ifndef _MVC_H
#define _MVC_H

/*********************************************************************
                        相关配置
*********************************************************************/

//定义通道掩码，《=8时应为unsigned char ,8-16时为unsigned short
#ifndef MvcChMask_t
  #define MvcChMask_t  unsigned char
#endif

/*********************************************************************
                        相关结构
*********************************************************************/
#include "IOCtrl.h" 

struct _MVC{
  unsigned char CurCh[VC_CHANNEL_GRP_COUNT];//当前采集的内部通道号
  MvcChMask_t  PrvState;    //上次扫描的对应通道状态,1高,0低
  MvcChMask_t  CurState;    //本次正在扫描的对应通道状态,1高,0低
  MvcChMask_t  State;       //总体状态,1高,0低  
  
};

extern struct _MVC MVC;

/*********************************************************************
                        相关函数
*********************************************************************/

//--------------------------------初始化-----------------------------
void MVC_Init(void);


//----------------------------任务函数------------------------------
//根据实时性要求，放在<=0.5ms进程中扫描，更高时放在中断中扫许
void MVC_Task(void);

//---------------------判断某通道是否为高电平------------------------
#define MVC_IsHight(ch)  (MVC.State & (1 << (ch)))

/*********************************************************************
                           回调函数
*********************************************************************/


#endif
