/***************************************************************************

           资源文件型文本文件-在使用TMenuBuf时的实现接口
                         
****************************************************************************/
#ifndef __RP_TXT_TMENU_H
#define __RP_TXT_TMENU_H

//-------------------------------初始化-------------------------------------
//返回负异常
signed char RP_TxtTMenuInit(unsigned char Rid);

//------------------------------回调函数实现---------------------------------
void RP_TxtTMenuNotify(unsigned char Type, void *pv);

#endif
