/******************************************************************************

                         各工具类参数结构定义及绘图接口

此模块与ResourcePlot.h无关
******************************************************************************/
#ifndef __RP_TOOLS_H 
#define __RP_TOOLS_H 
#ifdef SUPPORT_EX_PREINCLUDE//不支持Preinlude時
  #include "Preinclude.h"
#endif
#include "Color.h"

//-----------------------------工具类类型定义---------------------------
//最大支持16个：
//进度条，EN_FUN时为纵向进度条，否则为横向进度条
#define RP_TOOLS_PROGRESS       0  
#define RP_TOOLS_COUNT          1  //支持工具总数

/******************************************************************************
                             结构定义
******************************************************************************/

//-----------------------------进度条时参数结构---------------------------
//资源描述结构：((b15预留允许显示百分比进度))
struct _RpProgressDesc{
  unsigned short w;          //总宽度，高4bit; 左右边框宽度
  unsigned short h;          //总高度，高4bit: 上下边框高度
  Color_t cBg;                //底色
  Color_t cRect;              //边框色
  Color_t cFg[4];             //填充色,可由参数带入，选择4种色中的一种
};
//通过回调获得的参数结构：
struct _RpProgressPara{
  unsigned char Percent;   //0-100,即分为100档
  unsigned char FgId;      //cFg[4]定义的填充色下标，将用此颜色填充
};

//样式支持：
//可组合图标元素或背景图，实现更多功能或样式，如：

//1. 无边框进度条： 灭指定边框宽度与高度时
//2. 逐步增大效果： 底色 = 背景色时，实现此功能
//3. 圆角进度条： 背景图或图标作其背景时
//4. 带刻度线： 背景图或图标作其背景时
//5. 叠加百分比在进度条上显示： 百分比字符变量做其前景

//-----------------------------主结构--------------------------------------
//资源描述结构：
union _RpToolsDesc{
  struct _RpProgressDesc Progress;//进度条时
};

//通过回调获得的参数结构：
union _RpToolsPara{
  struct _RpProgressPara Progress;//进度条时
};

/******************************************************************************
                         绘图接口
******************************************************************************/

//-------------------------------绘制进度条-------------------------------
void RpTools_PlotProgress(const union _RpToolsDesc *pNsDesc,
                          const union _RpToolsPara *pNsPara,
                          unsigned char Info, //b7:实时刷新,b4:配置
                          unsigned short x, unsigned short y);//绝对x,y



#endif  //#ifndef __RP_TOOLS_H 



