/********************************************************************************

                      短路管理模块阵列

此模块仅简单实例化多个短路管理模块
*******************************************************************************/
#ifndef _SHORT_MNG_ARY_H
#define _SHORT_MNG_ARY_H
#ifdef SUPPORT_EX_PREINCLUDE//不支持Preinlude時
  #include "Preinclude.h"
#endif
/******************************************************************************
                        相关配置
******************************************************************************/

#ifndef SHORT_MNG_ARY_COUNT
  #define SHORT_MNG_ARY_COUNT   6
#endif

/******************************************************************************
                        相关结构
******************************************************************************/
#include "ShortMng.h"

struct _ShortMngAry{
  struct _ShortMng ShortMng[SHORT_MNG_ARY_COUNT];
};

extern struct _ShortMngAry ShortMngAry;

/*******************************************************************************
                               相关函数
*******************************************************************************/

//------------------------------得到对应通道管理器------------------------------
//const struct _ShortMng *ShortMngAry_GetMng(unsigned char Ch);
#define ShortMngAry_GetMng(ch)  (&ShortMngAry.ShortMng[ch])

//---------------------------------------初始化--------------------------------
//形参为总的上电延时时间，用于分时上电
void ShortMngAry_Init(unsigned char ShutDelay); 

//-----------------------------------任务函数----------------------------------
//放入128msS附近任务中扫描
void ShortMngAry_Task(void);

//-------------------------------置为掉电模式------------------------------
void ShortMngAry_ShutDown(void);//对应通道  

//------------------------------对应通道是否接入------------------------------
signed char ShortMngAry_IsShut(unsigned char Ch);


#endif
