/*******************************************************************************

                温度模块硬件相关定义-HC32内部温度时

*******************************************************************************/
#ifndef __TEMP_HC32_H
#define __TEMP_HC32_H

/*******************************************************************************
                            相关说明 
*******************************************************************************/
//----------------------HC32内部温度传感器计算说明------------------------------
  //根据资料，计算公式为：环境温度 = 25 + 0.0803 × Vref × ( AdcValue – Trim)
  //这里偏移为SEN_TEMP_ZERO即64, 考虑内核温升7，则:
  //环境偏移温度 = 25 + 0.0803 × Vref × ( AdcValue – Trim) + 64 - 7
  //             ->82 + 0.0803 × Vref × ( AdcValue – Trim)       
  //这里固定使用内部 2.5V参考则存主位置为：0x00100C36  ±3℃精度
  //将上述转换为这里的计算公式 环境温度 = (AdcValue - ZERO) * GAIN，
  //需进行体系转换, 结论推导:
  //  ->                    89 + (0.0803 × 2.5) × ( AdcValue – Trim)
  //  ->                    89 + 0.20075 × ( AdcValue – Trim)
  //  -> (0.20075 * 408.468) + 0.20075 × (AdcValue – Trim)
  //  ->  0.20075 X ((AdcValue – Trim) + 408.468)
  //  ->  0.20075 X (AdcValue - (Trim - 408.468))  故:

/*******************************************************************************
                            硬件相关定义 
*******************************************************************************/
//根据硬件特性，支持多种不同的滤波方式:

//支持滤波时,同时定义缓冲个数, <255
//#define SUPPORT_TEMP_FILETER  10 

//支持简单平均
//#define SUPPORT_TEMP_FILETER_AVERVGE   

//支持平均并去除最大最小值，同时定义前后去除个数,<(SUPPORT_TEMP_FILETER / 3)
//#define SUPPORT_TEMP_FILETER_AVERVGE_MID    3

//默认温度零点AD值   ZERO = (Trim - 408.468),取整=(Trim - 408)假定不为负:
#define TEMP_DEFAULT_ZERO ((*(unsigned short*)(0x00100C36) - 408))  

//默认温度AD值 Q值:  GAIN = 0.20075 (1 << SEN_TEMP_Q) = 6578
#define TEMP_DEFAULT_GAIN   6578

//增益使用的Q值
#define TEMP_GAIN_Q  15

//温差标定时，最小温差值
#define TEMP_DIFF_TEPM_MIN   10 

//温差标定时，最小信号值
#define TEMP_DIFF_SIGAL_MIN  10   

#endif






