/***************************************************************************

              （单例化）扩展输出8位(Extend Output 8Bit)接口
此模块负责将缓冲的位数据，通过并口,或串口(如595移位)驱动输出
这里只定义了接口，需根据情况具体实现
***************************************************************************/
#ifndef __EO8_H
#define __EO8_H
#ifdef SUPPORT_EX_PREINCLUDE//不支持Preinlude時
  #include "Preinclude.h"
#endif

/***************************************************************************
                              相关配置
***************************************************************************/

//定义开机默认值,不定义时为0
#ifndef EO8_DEFAULT
  #define   EO8_DEFAULT   0
#endif

/***************************************************************************
                              相关结构
***************************************************************************/
struct _EO8{
  unsigned char O;     //当前输出
  unsigned char PrvO;  //上次输出
};

extern struct _EO8  EO8; 

/***************************************************************************
                              相关函数
***************************************************************************/

//------------------------------初始化函数------------------------------
void EO8_Init(void);

//-----------------------------快速任务函数-----------------------------
//最长调用时间建议<=10ms
void EO8_FaskTask(void);

//---------------------------------读位输出--------------------------------
//可随时读
#define EO8_IsSet(mask)  (EO8.O & (mask))

//--------------------------------位输出操作---------------------------------
//普通写可在中断内调用，但输出有延时
#define EO8_Set(mask)  do{EO8.O |= (mask); }while(0)
#define EO8_Clr(mask)  do{EO8.O &= ~(mask); }while(0)

//快速写不可在中断内调用，但可立即得到输出结果
#define EO8_SetNow(mask)  do{EO8_Set(mask); EO8_FaskTask(); }while(0)
#define EO8_ClrNow(mask)  do{EO8_Clr(mask); EO8_FaskTask(); }while(0)

//-----------------------------读写字节输出--------------------------------
//可随时读
#define EO8_GetAll()  (EO8.O)
//普通写可在中断内调用，但输出有延时
#define EO8_SetAll(byte)      do{EO8.O = byte; }while(0)
//快速写不可在中断内调用，但可立即得到输出结果
#define EO8_SetAllFast(byte)  do{EO8_SetAll(byte); EO8_FaskTask(); }while(0)


#endif //#define __EO8_H

