/***********************************************************************

                         AD(硬件)比较模块
此模块需硬件AD比较器支持，根据给定条件设置比较后，中断处理                  
************************************************************************/
#ifndef _AD_CMP_H
#define _AD_CMP_H
#ifdef SUPPORT_EX_PREINCLUDE//不支持Preinlude時
  #include "Preinclude.h"
#endif

/*********************************************************************
                        相关函数
*********************************************************************/

//-----------------------------初始化-----------------------------
void AdCmp_Init(void);

//--------------------------设置比较条件--------------------------
void AdCmp_Condition(unsigned short lAD,   //低端比较AD值
                     unsigned short hAD,  //高端比较AD值
                     signed char Condition);//条件

//-----------------------开启需比较的AD通道--------------------
//需在停止采集时开启
void AdCmp_OpenCh(unsigned char Ch);

//-----------------------关闭需比较的AD通道--------------------
//需在停止采集时关闭
void AdCmp_CloseCh(unsigned char Ch);

//--------------------------启动比较----------------------------
void AdCmp_Start(void);

//-------------------------停止比较-----------------------------
void AdCmp_Stop(void);

/*********************************************************************
                           回调函数
*********************************************************************/

//----------------------中断件发生后将被调用------------------------
//对应通道掩码置位时，表示比较符合
void AdCmp_IRQ(unsigned short ChMask);



#endif
