/*******************************************************************************

                    压缩时间设置-在TMenu系统中的菜单实现
此模块通过回调独立于应用
*******************************************************************************/

#ifndef _ZIP_TIME_TMENU_H
#define _ZIP_TIME_TMENU_H

#include "TMenu.h"

/*******************************************************************************
                             对外输出
*******************************************************************************/
extern const TMenu_t TMenu_ZipTime; //菜单结构

/*******************************************************************************
                             回调函数
*******************************************************************************/

//----------------------------自已的父菜单----------------------------------
#ifndef ZIP_TIME_TMENU_PARENT
  #define ZIP_TIME_TMENU_PARENT   NULL //外部必须实现，此定义仅为编译通过
#endif

//------------------/由资源文件获取多国语言时ID前缀--------------------------
#ifndef ZIP_TIME_TMENU_PID //需由外部实一
  #define ZIP_TIME_TMENU_PID 0x80
#endif

//-------------------------------设置当前时间----------------------------------
void Menu_ZipTime_cbSet(unsigned long ZipTime);
  
#endif