/***************************************************************************
                    周期PWM信号输出产生器
 * 此模块主要用于周期性输出脉宽调制信号，给如通过电感产生高压给脉冲阀电容充电等场合
 * 此模块直接单例化，且频率,脉宽,周期PWM输出时间为定值
 * 此模块输出工作周期如下图所示:
     可触发的连续PWM输出(如没电时充满电)        周期PWM输出(如：有电时，补充充电)
 -----------------------------------------        ----        ----
                                          |________|   |________|
****************************************************************************/
#ifndef _PERIOD_PWM_GEN_H
#define _PERIOD_PWM_GEN_H

/***************************************************************************
                          相关配置
****************************************************************************/

//外部需要支持此模块时建议宏定义(全局里实现):
//#define SUPPORT_PERIOD_PWM_GEN    

//以下定时均以Task调用周期为单位
#ifndef PERIOD_PWM_GEN_PERIOD_OV//定义非连续输出时，周期时间
  #define PERIOD_PWM_GEN_PERIOD_OV     (5* 8)   
#endif

#ifndef PERIOD_PWM_GEN_PERIOD_DIS//定义非连续输出时，禁止输出时的时间
  #define PERIOD_PWM_GEN_PERIOD_DIS    (4* 8)     
#endif
//连续脉发连续输出时周期, 此周期*PERIOD_PWM_GEN_PERIOD_OV为连续时间
#ifndef PERIOD_PWM_GEN_CONTINUITY_COUNT
  #define PERIOD_PWM_GEN_CONTINUITY_COUNT    2
#endif

/***************************************************************************
                          相关结构
****************************************************************************/

struct _PeriodPwmGen{
  unsigned char ContinuityTimer;       //连续输出PWM信号定时器,此值为0时周期输出
  unsigned char PeriodTimer;           //周期定时器
};
extern struct _PeriodPwmGen PeriodPwmGen;

/***************************************************************************
                          相关函数
****************************************************************************/

//------------------------------初始化函数---------------------------------
//初始化后默认为停止状态
void PeriodPwmGen_Init(void);

//----------------------------任务函数-------------------------------------
//放在128ms定时器中
void PeriodPwmGen_Task(void);

//---------------------------启动函数-------------------------------------
//开始连续输出至周期输出
void PeriodPwmGen_Start(void);

//-----------------------------停止函数-------------------------------------
//停止输出
void PeriodPwmGen_Stop(void);

#endif //_PERIOD_PWM_GEN_H
