/*******************************************************************************

                    用户可定制查找表模块-实例化阵列实现
此模块独立与系统,即与应用无关
注:仅支持单调上升的查找表结构
********************************************************************************/
#ifndef __CUSTOM_LUT_ARY_H
#define __CUSTOM_LUT_ARY_H

/*******************************************************************************
                                相关配置
*******************************************************************************/

//定义实例化个数
#ifndef CUSTOM_LUT_ARY_SIZE
  #define CUSTOM_LUT_ARY_SIZE    1     //默认1个
#endif

/*******************************************************************************
                                 相关结构
*******************************************************************************/
#include "CustomLut.h"
//信息结构
struct _CustomLutAry{
  struct _CustomLut Ary[CUSTOM_LUT_ARY_SIZE];
};

extern struct _CustomLutAry CustomLutAry; //实例化

/********************************************************************************
                              相关函数
********************************************************************************/

//--------------------------------初始化函数------------------------------------
void CustomLutAry_Init(signed char Inited);//形参为已初始化标志

//------------------------------由Id得到实例------------------------------------
//未找到时为首个
struct _CustomLut* CustomLutAry_pGet(unsigned char Id);

//------------------------------由Id直接得到查找表------------------------------
//未找到时为首个
struct _NolinearConvertTbl *CustomLutAry_pGetLut(unsigned char Id);



#endif //#define __CUSTOM_LUT_ARY_H



