/*******************************************************************************

					            APP总体配置模块
此模块将全局杂散到的到需存储EEPROM的变量，统一进行管理
********************************************************************************/
#ifndef __GCFG_H 
#define __GCFG_H

//此模块需实现的应用层接口
#include "gCfg_App.h" //具体示例模板见gCfg_AppT.h

/****************************************************************************
                             全局声明
****************************************************************************/
//使用外部没有定义默认常量gCfg_Default，可用于指定存放位置。
//#define  G_CFG_EX_DEFAULT 

/****************************************************************************
                             结构定义
****************************************************************************/
struct _gCfg{
  unsigned char Bit[GCFG_BIT_SIZE];      //位配置
  unsigned char Byte[GCFG_BYTE_SIZE];   //通用字节配置
};
extern struct _gCfg gCfg;

/****************************************************************************
                              相关函数
****************************************************************************/
//--------------------------------初始化函数------------------------------
void gCfg_Init(unsigned char Inited,  signed char IsHandInit);

//-----------------------------判断位配置是否置位--------------------------
#define gCfg_BitIsSet(pos, bitMask)  (gCfg.Bit[pos] & (bitMask))

//-----------------------------设置并保存位配置--------------------------
void gCfg_CfgBit(unsigned char Pos,    //位置下标
                 unsigned char BitCfg,    //位配置
                 unsigned char ValidMask); //影响位

//------------------------------------得到字节位--------------------------
#define gCfg_GetByte(pos)  (gCfg.Byte[pos])

//-------------------------------设置通用字节数据并保存----------------------
void gCfg_CfgData(unsigned char Pos,
                  unsigned char Byte);


#endif

