/***************************************************************************

     数字电位器(POT)回调函数-在使用CAT5171，并使用I2C单例化IO模拟时的实现
实现为阻塞型，并支持同一I2C两个CAT5171芯片(AD0不一样)
****************************************************************************/

#include "Pot.h"
#include "I2cSio.h"
#include <string.h>


/***************************************************************************
                          回调函数实现
***************************************************************************/

//-------------------------硬件初始化调用-----------------------------
void Pot_cbPos2HwInit(void)
{
  I2cSio.CmdSize = 1; //指令1Byte
  I2cSio.DataSize = 1; //数据1Byte
  I2cSio.Flag = I2C_SIO_CMD_RD | 10;//预置为默认标志 
  I2cSio.Cmd[0] = 0;//预置为正常写
}

//-------------------------开始电位器位置到硬件POT-----------------------------
//即将当前位置打到数字电位器上，根据不同通讯由硬件实现
//返回是否启动成功 0成功,非0失败
signed char Pot_cbPos2HwStart(void)
{
  if(Pot.Id) I2cSio.SlvAdr = 45;//0b0101100 | 0b1;
  else I2cSio.SlvAdr = 44;//0b0101100;
  I2cSio.Data[0] = Pot.CurPos; //给出位置
  I2cSio_ReStart(); //写硬件
  return 0;//成功
}

//-------------------------判断硬件是否通讯中----------------------------
//返回0:正常结束，负：未通讯上结束，正：通讯过程中
signed char Pot_cbIsHwCommDoing(void)
{
  return (I2cSio.Flag & I2C_SIO_COMM_ERR);//异常结束 
}




